{
    "url": "https://economictimes.indiatimes.com/markets/expert-view/we-are-getting-ready-to-be-a-global-player-says-jairam-sampath-of-kaynes-technology/articleshow/108191489.cms?from=mdr",
    "title": "We are getting ready to be a global player, says Jairam Sampath of Kaynes Technology",
    "date": "Last Updated: Mar 04, 2024, 09:08:00 AM IST",
    "text": "Jairam Sampath , Whole-time Director & CFO,  Kaynes Technology , says “the  semiconductor business  is part of the  Kaynes Technology Group . It is in a separate subsidiary called  Kaynes SemiCon Private Limited  and this is part of our endeavour to become a completely integrated  EMS player  and a  long range planning . The steps taken today are with a view of about 5 to 10 years henceforth the market conditions and technology changes.” Given that the Street has been awaiting an approval with respect to the semiconductor unit, there has been a delay. We understand that you have still not received it. What is the reason and can you give any sort of a timeline? Jairam Sampath : Firstly, what happened yesterday was very encouraging and that signified the start of the process in India for approving this very important high-tech industry and we are at the final stages of approval and we are pretty confident it would happen anytime now. By announcing it on Thursday, the government has taken a very bold step. There are three projects, not one and so obviously they have stated their intent and we are very glad that it has started off this entire approval process. We are very confident that in a few days' time, we should get their approvals. That is in the final stages. Unlock Leadership Excellence with a Range of CXO Courses Offering College Course Website IIM Lucknow IIML Chief Executive Officer Programme Visit IIM Kozhikode IIMK Chief Product Officer Programme Visit Indian School of Business ISB Chief Digital Officer Visit The fact that you have not received the approval, is that a pushback for you? Jairam Sampath:  Not really. Actually, the government process is pretty long, even though as much as people would like to see the approvals quickly, it takes a long time because they have a technical approval, they have a financial approval, they also want to make sure that companies which invest are able to make good of the investment even post the subsidy regime.  We are very happy that in this entire process, the government agencies have almost acted like our advisors and consultants and mentors actually to make sure that every step of the way, we make the right choices and decisions and I think this is the minimum time it takes to push through any large project and these are more directional in nature when a government wants to ensure that once India is in the march towards making capacities in this area, we become a country with state of the art stuff. We are pretty confident and in fact, it is positive because internally most of the approvals are done from what we understand and now we await the final nod. There are lots of projects that the government considers, so we are okay with waiting for a bit but I think a few days is what we have to wait. You Might Also Like: Cyient DLM, Kaynes Technology among JM Financial's 4 electronic manufacturing stocks to buy Will the plan to expand in the semiconductor business, be part of Kaynes Technologies or is that a separate subsidiary? Jairam Sampath:  It is part of the Kaynes Technology Group. It is in the separate subsidiary called Kaynes SemiCon Private Limited and this is part of our endeavour to become a completely integrated EMS player and this is part of a long range planning, so what we have taken steps today is with a view of about 5 to 10 years henceforth the market conditions and technology changes, etc. We are getting ready to be a  global player . We believe that there is a first mover advantage for an EMS company to have ability in the OSAT area so that we can make modules and all other advanced packaging which becomes critical for even EMS players in the future.  I am happy to tell you that we are one of the first actually in the global industry to have considered not just the assembly, but also the semiconductor assembly as well as the high-density interconnection PC boards and we think that this will yield results in 5 to 10 years’ time from now. And also with the government's environment being very conducive, so we thought that this is the time to take those steps. So, the semiconductor business would be at an arm's length and the Kaynes Technology listed entity has got nothing to do with it. Can I infer that? Jairam Sampath:  No, no. The investment is from Kaynes Technology. We basically had a qualified institutional placement. We create subsidiaries to give it leadership and so that we will have a different CEO, because culturally businesses that our company encompasses are a little different. We want to give independent policymaking and independent decision making to those entities and that is why we have created a Kaynes SemiCon Private Limited, a 100% owned subsidiary of our parent company Kaynes Technology. This is a part of Kaynes Technologies plan. The semiconductor business requires a lot of upfront cash. It is a business which will take at least three to four years, if not less, to start generating returns. This means that you are actually shifting away from your DNA. You are essentially an EMS company moving into chips. It is a great natural backward integration. But this will be coming at a big cost. This will be coming at a time when your return ratios will take a hit on a combined basis. Are you prepared? Jairam Sampath:  When we take such large steps and these are proven steps, people have done it in the past in other countries. So, it is a matter of doing it in India. With a very conducive environment from the government in terms of policymaking and subsidies, we can definitely pull it off. We have done the math in terms of financials and from day one, we have been considering that this project takes about two years to establish and then thereafter there is a gradation of capacity utilisation that happened and so on.  You Might Also Like: Kaynes Technology, Syrma from EMS space could rally 15-30% in 1 year: Siddhartha Khemka We have been very conservative in our forecast and whatever forecast we give for the company is inclusive or probably keeping in mind that there will be let us say initial non-performance from some of the assets that we put in and so two years’ time we have given for the project and we are pretty confident to pull it off. We have three collaborations too, technical collaborations, so it is probably one of the best in the industry, both Malaysia, Taiwan and Japan and we are processing our let us say plans for the sake of the long term, so not just the initial packaging OSAT but also the advanced packaging and component, semiconductors, etc, that is also. That is why we have taken a little longer than other players, but we are there and as far as the approval status in the government is concerned, we are in the penultimate stage and we look forward to that. There are no more details to be given from the company's side. You Might Also Like: India comes full circuit: Global tech giants set sights on the country for electronics production (You can now subscribe to our  ETMarkets WhatsApp channel )"
}