{
    "url": "https://www.marketbeat.com/instant-alerts/nyse-vsh-analyst-earnings-estimates-2024-04-02/",
    "title": "Vishay Intertechnology, Inc. (NYSE:VSH) Forecasted to Post Q1 2024 Earnings of $0.20 Per Share",
    "content": "Vishay Intertechnology, Inc. ( NYSE:VSH  -  Free Report ) - Stock analysts at Zacks Research reduced their Q1 2024 EPS estimates for Vishay Intertechnology in a research report issued on Monday, April 1st. Zacks Research analyst R. Department now anticipates that the semiconductor company will post earnings of $0.20 per share for the quarter, down from their prior estimate of $0.23. The consensus estimate for Vishay Intertechnology's current full-year earnings is $1.15 per share. Zacks Research also issued estimates for Vishay Intertechnology's Q2 2024 earnings at $0.27 EPS, Q3 2024 earnings at $0.34 EPS, Q4 2024 earnings at $0.34 EPS, FY2024 earnings at $1.15 EPS, Q1 2025 earnings at $0.34 EPS, Q2 2025 earnings at $0.43 EPS, Q3 2025 earnings at $0.52 EPS, Q4 2025 earnings at $0.57 EPS, FY2025 earnings at $1.86 EPS and Q1 2026 earnings at $0.78 EPS.  Get  Vishay Intertechnology  alerts: Sign Up Vishay Intertechnology ( NYSE:VSH  -  Get Free Report ) last released its quarterly earnings data on Wednesday, February 7th. The semiconductor company reported $0.37 earnings per share (EPS) for the quarter, beating the consensus estimate of $0.36 by $0.01. Vishay Intertechnology had a net margin of 9.52% and a return on equity of 15.72%. The company had revenue of $785.24 million during the quarter, compared to the consensus estimate of $787.15 million. During the same quarter in the prior year, the firm posted $0.69 earnings per share. Vishay Intertechnology's revenue for the quarter was down 8.2% on a year-over-year basis.  Ad   Crypto 101 Media Elon Musk Leak and the $16T Crypto Shock Leaked Elon Musk call reveals shocking plan to replace banks.\nAs Musk's plan rolls out, industry experts predict it could spark a wave of mass crypto adoption. Triggering a new crypto bull run.\nWhile helping drive a booming crypto asset class up from $2.5-billion to $16-trillion (a 6,400x increase) by 2030.\n Click here now to get your copy. Vishay Intertechnology Stock Performance NYSE VSH  traded down $0.54 during trading hours on Tuesday, hitting $21.98. The company had a trading volume of 2,595,956 shares, compared to its average volume of 1,336,902. The company has a debt-to-equity ratio of 0.37, a quick ratio of 2.38 and a current ratio of 3.32. Vishay Intertechnology has a 1-year low of $20.57 and a 1-year high of $30.10. The company has a market cap of $3.02 billion, a PE ratio of 9.52 and a beta of 1.24. The business has a 50 day moving average of $22.20 and a 200-day moving average of $22.89.  Vishay Intertechnology Announces Dividend The business also recently disclosed a quarterly dividend, which was paid on Tuesday, March 26th. Shareholders of record on Thursday, March 14th were paid a $0.10 dividend. The ex-dividend date of this dividend was Wednesday, March 13th. This represents a $0.40 annualized dividend and a yield of 1.82%. Vishay Intertechnology's dividend payout ratio is presently 17.32%.  Insider Buying and Selling at Vishay Intertechnology In other news, Chairman  Marc Zandman  sold 26,154 shares of the stock in a transaction dated Monday, March 4th. The shares were sold at an average price of $22.83, for a total transaction of $597,095.82. Following the completion of the sale, the chairman now owns 73,678 shares in the company, valued at $1,682,068.74. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through  this link . 8.02% of the stock is currently owned by insiders.  Institutional Investors Weigh In On Vishay Intertechnology Several hedge funds have recently made changes to their positions in the business. Coppell Advisory Solutions LLC purchased a new position in Vishay Intertechnology during the second quarter worth about $27,000. Fairfield Bush & CO. purchased a new position in Vishay Intertechnology during the first quarter worth about $35,000. Fifth Third Bancorp raised its holdings in Vishay Intertechnology by 60.9% during the third quarter. Fifth Third Bancorp now owns 1,477 shares of the semiconductor company's stock worth $37,000 after purchasing an additional 559 shares in the last quarter. C M Bidwell & Associates Ltd. purchased a new position in Vishay Intertechnology during the second quarter worth about $39,000. Finally, Castleview Partners LLC purchased a new position in Vishay Intertechnology during the second quarter worth about $42,000. Institutional investors and hedge funds own 93.66% of the company's stock.  Vishay Intertechnology Company Profile  ( Get Free Report ) Vishay Intertechnology, Inc manufactures and sells discrete semiconductors and passive electronic components in Asia, Europe, and the Americas. The company operates through Metal Oxide Semiconductor Field Effect Transistors (MOSFETs), Diodes, Optoelectronic Components, Resistors, Inductors, and Capacitors segments. See Also Five stocks we like better than Vishay Intertechnology Want to Profit on the Downtrend? Downtrends, Explained. Low Interest Rates Can Help These Commercial Banks Rally Higher Bank Stocks - Best Bank Stocks to Invest In Tesla Stock Drops on Weak Delivery Numbers and it May Fall More 3 Ways To Invest In Coffee, Other Than Drinking It PVH Stock Gets 25% Discount: Is Now the Time to Buy?   → Elon Musk Leak and the $16T Crypto Shock   (From Crypto 101 Media)   (Ad) Should you invest $1,000 in Vishay Intertechnology right now? Before you consider Vishay Intertechnology, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the  five stocks  that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Vishay Intertechnology wasn't on the list. While Vishay Intertechnology currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here  13 Stocks Institutional Investors Won't Stop Buying Which stocks are major institutional investors including hedge funds and endowments buying in today's market? Click the link below and we'll send you MarketBeat's list of thirteen stocks that institutional investors are buying up as quickly as they can. Get This Free Report"
}