{
    "url": "https://www.theregister.com/2024/04/02/meta_facebook_watch_netflix/",
    "title": "No content found using selector: {'tag': 'h1', 'class': 'header_right'}",
    "subtitle": "No content found using selector: {'tag': 'h2', 'class': 'header_right'}",
    "author": "Thomas Claburn",
    "content": "Meta allegedly starved its Facebook Watch video service to appease Netflix and sustain its ad monopoly, advertisers suing the biz have claimed. \n The  lawsuit  [PDF], filed on December 3, 2020, was heavily redacted when the complaint was  amended  [PDF] with additional details on February 28, 2022. But discovery letter briefs filed with the court last year were unsealed last week and shed light on some of the claims by the plaintiffs that were only cursorily addressed in the initial complaints. \n One such revelation involved  Project Ghostbusers , an alleged Meta initiative to intercept data traffic from rival Snapchat to gain competitive intelligence. \n \n \n \n \n \n \n \n Another aspect of the competition claim involves Meta's relationship with Netflix, a deal that allegedly helped Meta maintain monopoly power over social media advertising. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n As outlined in a June 14  letter  [PDF] last year by plaintiffs' co-lead counsel Brian Dunne of Bathaee Dunne LLP, by mid-2017 Facebook Watch had become competitive with Netflix, which posed a problem because Reed Hastings, co-founder of Netflix and co-CEO at the time, was also member of Facebook's board of directors. \n \"Over the next year, in a period of high apex-level communications between Hastings and Facebook’s CEO and COO (Mark Zuckerberg and Sheryl Sandberg), the companies struck an agreement in which Facebook abruptly cut original programming from Watch beginning in May 2018, withdrawing from direct competition with Netflix, in exchange for increased signals (specific types of data used for Facebook’s ad models) sharing and ad purchases by Netflix,\" Dunne wrote. \n \n \n \n \n \n \n \n \"This agreement hurt one Facebook product (Watch) in order to serve the company’s primary goal of protecting its monopoly position in the United States Social Advertising Market, a digital advertising submarket in which Facebook commanded a substantial price premium and worked to maintain its competitive moat through any means at its disposal.\" \n The letter represents an effort to convince the judge overseeing the case to compel Netflix to produce internal documents related to the plaintiffs' claims. In a separate document production  letter  [PDF] from April 14, 2023, Dunne seeks support to compel Hastings to respond to a demand for documents. \n Hastings, Dunne wrote, \"personally directed the companies’ relationship, from advertising spend, to data-sharing agreements, to communications about and negotiations to end competition in streaming video.\" \n \n Ex-White House CIO tells The Reg: TikTok ban may be diplomatic disaster \n Malicious xz backdoor reveals fragility of open source \n Microsoft warns deepfake election subversion is disturbingly easy \n Rust developers at Google are twice as productive as C++ teams \n \n The special relationship between Meta/Facebook and Netflix, the plaintiffs argue, was fundamentally anticompetitive. Dunne's April 2023 letter describes how Hastings joined the board of Facebook in June 2011 and within a month announced an integration to share Netflix user data internationally with Facebook, and also lobbied Congress to allow such data sharing in the US. \n \"By 2013, Netflix had begun entering into a series of 'Facebook Extended API' agreements, including a so-called 'Inbox API' agreement that allowed Netflix programmatic access to Facebook’s user’s private message inboxes, in exchange for which Netflix would 'provide to FB a written report every two weeks that shows daily counts of recommendation sends and recipient clicks by interface, initiation surface, and/or implementation variant (e.g., Facebook vs. non-Facebook recommendation recipients),'\" Dunne wrote, citing an agreement and email entered into evidence. \n \n \n \n \n \n \n \n The letter also says that Facebook provided Netflix with access to the \"Titan API,\" a private API that allows approved partners to access \"among other things, Facebook user’s 'messaging app and non-app friends.'\" The wording of \"Inbox API\" description makes it sound as if Netflix could read the private messages of Facebook users, but that's not the case, according to Meta. \n Netflix did not respond to a request for comment. \n \"Meta didn’t share people’s private messages with Netflix,\" a company spokesperson told  The Register , citing a  2018 post  explaining the arrangement. \"As the document says, the agreement allowed people to message their friends on Facebook about what they were watching on Netflix, directly from the Netflix app. Such agreements are commonplace in the industry. We are confident the facts will show this complaint is meritless.\" \n The commonness of such agreements, however, doesn't necessarily mean they're legal. The Network Bidding Agreement between Google and Meta/Facebook, known as \"Jedi Blue,\" is currently being challenged in Texas' antitrust  lawsuit  [PDF] against Google. ®   \n Get our   Tech Resources"
}